Revit 2027 API
CloudPoint Implicit Conversion (CloudPoint to XYZ)
 Creates an XYZ object from this point cloud.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static implicit operator XYZ (
	CloudPoint cp
)
Public Shared Widening Operator CType (
	cp As CloudPoint
) As XYZ
static implicit operator XYZ^ (
	CloudPoint cp
)
F# does not support the declaration of new casting operators.
Parameters
cp CloudPoint
Return Value
XYZ
See Also
Reference
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace